app/controllers/collaborative_games_controller.rb

  def index
    @games = CollaborativeGame.all
---
SELECT * FROM "collaborative_games"

  def create
    @game = CollaborativeGame.new(params[:collaborative_game])
    @game.leader = current_user.email

    respond_to do |format|
      if @game.save
---
INSERT INTO "collaborative_games" ("name", "users_id", "created_at", "updated_at", "description") VALUES('Hi all', NULL, '2009-06-29 16:12:35', '2009-06-29 16:12:35', 'I''m a user')

  def update
    @game.update_attributes(params[:collaborative_game])
---
UPDATE "collaborative_games" SET "updated_at" = '2009-06-29 12:19:50', "description" = 'Cool, it works...' WHERE "id" = 7

    def find_game
      begin
        @game = CollaborativeGame.find(params[:id])
---
SELECT * FROM "collaborative_games" WHERE ("collaborative_games"."id" = 7)