app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "password_salt", "persistence_token", "email") VALUES('2009-06-26 12:33:42', '7f83ce10cdd604372ecd0ee46d5529825c32b28ae5398d8dd858367ef4dab6f02317d48fe9a57ef7cece4f634c2d7dd2d4b63066da5cda225e339020572aebfc', '2009-06-26 12:33:42', 'IMRl3fjMBLtR92q6s75n', '955f60d33ead3c64926c71b0ba47daaf8b51655c939cb149139ef72953b9daa8d26dcd09842f7b810b40238dee7513a4a20a5b95186d5f2c27b7d783baccb9a0', 'nathansamson@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save